platformio/platform-ststm32/misc/svd/STM32C091.svd
        <register>
          <name>PWR_PUCRD</name>
          <displayName>PWR_PUCRD</displayName>
          <description>PWR Port D pull-up control register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PU0</name>
              <description>Port D pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PU3 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU1</name>
              <description>Port D pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PU3 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU2</name>
              <description>Port D pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PU3 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU3</name>
              <description>Port D pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PU3 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU4</name>
              <description>Port D pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PU3 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU5</name>
              <description>Port D pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PU3 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU6</name>
              <description>Port D pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PU3 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU8</name>
              <description>Port D pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PD[i] I/O.
Only available on STM32C071xx.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU9</name>
              <description>Port D pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PD[i] I/O.
Only available on STM32C071xx.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PDCRD</name>
          <displayName>PWR_PDCRD</displayName>
          <description>PWR Port D pull-down control register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD0</name>
              <description>Port D pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PD3 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD1</name>
              <description>Port D pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PD3 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD2</name>
              <description>Port D pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PD3 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD3</name>
              <description>Port D pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PD3 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD4</name>
              <description>Port D pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PD3 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD5</name>
              <description>Port D pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PD3 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD6</name>
              <description>Port D pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PD[i] I/O.
Not available on STM32C011xx. On STM32C031xx, only PD3 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD8</name>
              <description>Port D pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PD[i] I/O.
Only available on STM32C071xx.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD9</name>
              <description>Port D pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PD[i] I/O.
Only available on STM32C071xx.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PUCRF</name>
          <displayName>PWR_PUCRF</displayName>
          <description>PWR Port F pull-up control register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PU0</name>
              <description>Port F pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PF[i] I/O.
On STM32C011xx, only PU2 is available. On STM32C031xx, only PU2 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU1</name>
              <description>Port F pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PF[i] I/O.
On STM32C011xx, only PU2 is available. On STM32C031xx, only PU2 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU2</name>
              <description>Port F pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PF[i] I/O.
On STM32C011xx, only PU2 is available. On STM32C031xx, only PU2 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU3</name>
              <description>Port F pull-up bit i
Setting PUi bit while the corresponding PDi bit is zero and the APC bit of the PWR_CR3 register is set activates a pull-up device on the PF[i] I/O.
On STM32C011xx, only PU2 is available. On STM32C031xx, only PU2 to PU0 are available.
Note: For the same pin, this pull-up device must not be activated when a pull-down device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PDCRF</name>
          <displayName>PWR_PDCRF</displayName>
          <description>PWR Port F pull-down control register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD0</name>
              <description>Port F pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PF[i] I/O.
On STM32C011xx, only PD2 is available. On STM32C031xx, only PD2 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD1</name>
              <description>Port F pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PF[i] I/O.
On STM32C011xx, only PD2 is available. On STM32C031xx, only PD2 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD2</name>
              <description>Port F pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PF[i] I/O.
On STM32C011xx, only PD2 is available. On STM32C031xx, only PD2 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD3</name>
              <description>Port F pull-down bit i
Setting PDi bit while the APC bit of the PWR_CR3 register is set activates a pull-down device on the PF[i] I/O.
On STM32C011xx, only PD2 is available. On STM32C031xx, only PD2 to PD0 are available.
Note: For the same pin, this pull-down device must not be activated when a pull-up device is set through the GPIOx_PUPDR register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BKP0R</name>
          <displayName>PWR_BKP0R</displayName>
          <description>PWR backup 0 register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BKP</name>
              <description>Backup bitfield
This bitfield retains information when the device is in Standby.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BKP1R</name>
          <displayName>PWR_BKP1R</displayName>
          <description>PWR backup 1 register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BKP</name>
              <description>Backup bitfield
This bitfield retains information when the device is in Standby.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BKP2R</name>
          <displayName>PWR_BKP2R</displayName>
          <description>PWR backup 2 register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BKP</name>
              <description>Backup bitfield
This bitfield retains information when the device is in Standby.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BKP3R</name>
          <displayName>PWR_BKP3R</displayName>
          <description>PWR backup 3 register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BKP</name>
              <description>Backup bitfield
This bitfield retains information when the device is in Standby.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
